In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("marks.csv")

In [3]:
df.head()

   StudentID  Maths  Python  ML
0        101     78      85  90
1        102     65      70  60
2        103     88      92  95
3        104     50      60  45
4        105     80      88  84

In [4]:
df["TotalMarks"]=df["Maths"]+df["Python"]+df["ML"]

In [5]:
df.head()

   StudentID  Maths  Python  ML  TotalMarks
0        101     78      85  90         253
1        102     65      70  60         195
2        103     88      92  95         275
3        104     50      60  45         155
4        105     80      88  84         252

In [10]:
df["Percentage"]=round((df["TotalMarks"]/300)*100,2)

In [11]:
df.head()

   StudentID  Maths  Python  ML  TotalMarks  Percentage
0        101     78      85  90         253       84.33
1        102     65      70  60         195       65.00
2        103     88      92  95         275       91.67
3        104     50      60  45         155       51.67
4        105     80      88  84         252       84.00

In [12]:
df["Result"] = df["Percentage"].apply(lambda x: "Pass" if x >= 50 else "Fail")

In [13]:
df.head()

   StudentID  Maths  Python  ML  TotalMarks  Percentage Result
0        101     78      85  90         253       84.33   Pass
1        102     65      70  60         195       65.00   Pass
2        103     88      92  95         275       91.67   Pass
3        104     50      60  45         155       51.67   Pass
4        105     80      88  84         252       84.00   Pass

In [15]:
df.to_csv("student_results.csv", index=False)